The  FabricationPart  type exposes the following members.
 Methods
Name  |   Description
AdjustEndLength
 Adjusts the length for the specified connector.
AlignPartByConnectors
 Moves fabrication part by one of its connectors and aligns it to another connector.
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from  Element  .)
CanAdjustEndLength
 Checks if the end of fabrication part can be adjusted.
CanBeHidden
 Indicates if the element can be hidden in the view.
 (Inherited from  Element  .)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from  Element  .)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from  Element  .)
CanHaveTypeAssigned
 Identifies if the element can have a type assigned.
 (Inherited from  Element  .)
CanSplitStraight
 Validates if the straight can be split into two at the passed in point.
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from  Element  .)
ConnectAndCouple
 Makes a connection between the specified connectors and adds coupling if necessary.
Create(Document, FabricationServiceButton, Int32, ElementId)
 Creates a fabrication part element based on button.
Create(Document, FabricationServiceButton, Double, Double, ElementId)
 Creates a fabrication part element based on button and size.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId)
 Creates a free placed hanger.
CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from  Element  .)
Dispose   |   (Inherited from  Element  .)
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from  Element  .)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from  Element  .)
GetCalculatedDimensionValue
 Gets the calculated dimension value.
GetDimensionCalculatedOptions
 Gets the calculated options of the fabrication dimension.
GetDimensions
 Gets all fabrication dimensions.
GetDimensionValue
 Gets the value of the fabrication dimension, returns value in Revit internal units.
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from  Element  .)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from  Element  .)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from  Element  .)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from  Element  .)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from  Element  .)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from  Element  .)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from  Element  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetHostedInfo
 Gets the fabrication hosted element information.
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from  Element  .)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from  Element  .)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from  Element  .)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from  Element  .)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from  Element  .)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from  Element  .)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from  Element  .)
GetParameters
 Retrieves the parameters from the element via the given name.
 (Inherited from  Element  .)
GetPartAncillaryUsage
 Gets a list of all ancillary usage information for the part.
GetPartCustomDataInteger
 Get custom data integer value for the specified custom data.
GetPartCustomDataReal
 Get custom data real value for the specified custom data.
GetPartCustomDataText
 Get custom data text for the specified custom data.
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from  Element  .)
GetProductListEntryCount
 Gets the number of product entries for this part.
GetProductListEntryName
 Gets the specified product list entry name.
GetRodInfo
 Gets the fabrication rod information.
GetTransform
 Gets the transformation matrix of the fabrication part element.
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from  Element  .)
GetValidTypes
 Obtains a set of types that are valid for this element.
 (Inherited from  Element  .)
HasCustomData
 Check if fabrication part contains custom data already.
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from  Element  .)
IsAHanger
 Checks whether it is a hanger.
IsAStraight
 Checks whether it is a straight part.
IsATap
 Checks if it is any sort of tap.
IsDimensionCalculated
 Checks if the fabrication dimension is calculated.
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from  Element  .)
IsHidden
 Identifies if the element has been permanently hidden in the view.
 (Inherited from  Element  .)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from  Element  .)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from  Element  .)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from  Element  .)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from  Element  .)
IsProductList
 Gets whether or not the fabrication part is a product list.
IsProductListEntryCompatibleSize
 Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
IsStraightSegment
 Validates if the part is a straight.
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from  Element  .)
LookupParameter
 Attempts to find a parameter on the element which has the given name.
 (Inherited from  Element  .)
OptimizeLengths
 Optimizes the length fabrication straight parts.
PlaceAsTap
 Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
PlaceFittingAsCutIn
 Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from  Element  .)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from  Element  .)
Reposition
 Repositions the fabrication straight part to another end of the run.
RotateConnectedPartByConnector
 Rotates a connected fabrication part around the axis of the specified connector.
RotateConnectedTap
 Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
SetCalculatedDimensionValue
 Sets the calculated dimension value.
SetDimensionValue
 Sets the fabrication dimension value. The value is in Revit internal units.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from  Element  .)
SetPartCustomDataText
 Set the custom data real value for the specified custom data.
SetPositionByEnd
 Positions the connector of the fabrication part element by the passed point.
SplitStraight
 Splits the straight into two at the passed in point.
StretchAndFit
 Stretch the fabrication part from the specified connector and fit to the target routing end.
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  FabricationPart Class
  Autodesk.Revit.DB Namespace